Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcu_stm32f0x.c
/*
        Name: mcu_stm32f4x.c
        Description: Contains all the function declarations necessary to
   interact with the MCU. This provides a opac intenterface between the µCNC and
   the MCU unit used to power the µCNC.

        Copyright: Copyright (c) João Martins
        Author: João Martins
        Date: 01/11/2019

        µCNC is free software: you can redistribute it and/or modify
        it under the terms of the GNU General Public License as published by
        the Free Software Foundation, either version 3 of the License, or
        (at your option) any later version. Please see
   <http://www.gnu.org/licenses/>

        µCNC is distributed WITHOUT ANY WARRANTY;
        Also without the implied warranty of	MERCHANTABILITY or FITNESS FOR A
   PARTICULAR PURPOSE. See the	GNU General Public License for more details.
*/

#include "../../../cnc.h"

#if (MCU == MCU_STM32F0X)
#include "core_cm0.h"
#include "mcumap_stm32f0x.h"
#include "stm32f0xx.h"
#include <math.h>

#ifdef MCU_HAS_USB
#include <tusb_ucnc.h>
#endif

#ifndef FLASH_SIZE
#define FLASH_SIZE (FLASH_BANK1_END - FLASH_BASE + 1)
#endif

// this is needed if a custom flash size is defined
#define FLASH_LIMIT (FLASH_BASE + FLASH_SIZE - 1)

#if (FLASH_LIMIT > FLASH_BANK1_END)
#error "The set FLASH_SIZE is beyond the chip capability"
#endif

#if (FLASH_BANK1_END <= 0x0801FFFFUL)
#ifndef FLASH_PAGE_SIZE
#define FLASH_PAGE_SIZE (1 << 10)
#endif
#define FLASH_EEPROM_PAGES (((NVM_STORAGE_SIZE - 1) >> 10) + 1)
#define FLASH_EEPROM (FLASH_LIMIT - ((FLASH_EEPROM_PAGES << 10) - 1))
#define FLASH_PAGE_MASK (0xFFFF - (1 << 10) + 1)
#define FLASH_PAGE_OFFSET_MASK (0xFFFF & ~FLASH_PAGE_MASK)
#else
#ifndef FLASH_PAGE_SIZE
#define FLASH_PAGE_SIZE (1 << 11)
#endif
#define FLASH_EEPROM_PAGES (((NVM_STORAGE_SIZE - 1) >> 11) + 1)
#define FLASH_EEPROM (FLASH_LIMIT - ((FLASH_EEPROM_PAGES << 11) - 1))
#define FLASH_PAGE_MASK (0xFFFF - (1 << 11) + 1)
#define FLASH_PAGE_OFFSET_MASK (0xFFFF & ~FLASH_PAGE_MASK)
#endif

#define READ_FLASH(ram_ptr, flash_ptr) (*ram_ptr = ~(*flash_ptr))
#define WRITE_FLASH(flash_ptr, ram_ptr) (*flash_ptr = ~(*ram_ptr))
static uint8_t stm32_flash_page[FLASH_PAGE_SIZE];
static uint16_t stm32_flash_current_page;
static bool stm32_flash_modified;

/**
 * The internal clock counter
 * Increments every millisecond
 * Can count up to almost 50 days
 **/
static volatile uint32_t mcu_runtime_ms;

/**
 * The isr functions
 * The respective IRQHandler will execute these functions
 **/
#ifdef MCU_HAS_UART
#ifndef UART_TX_BUFFER_SIZE
#define UART_TX_BUFFER_SIZE 64
#endif
DECL_BUFFER(uint8_t, uart_tx, UART_TX_BUFFER_SIZE);
DECL_BUFFER(uint8_t, uart_rx, RX_BUFFER_SIZE);

void MCU_SERIAL_ISR(void) {
  if (COM_UART->ISR & USART_ISR_RXNE) {
    uint8_t c = COM_INREG;
#if !defined(DETACH_UART_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(uart_rx, &c)) {
        STREAM_OVF(c);
      }
    }
#else
    mcu_uart_rx_cb(c);
#endif
  }

  if ((COM_UART->ISR & USART_ISR_TXE) && (COM_UART->CR1 & USART_CR1_TXEIE)) {
    uint8_t c;

    if (!BUFFER_TRY_DEQUEUE(uart_tx, &c)) {
      COM_UART->CR1 &= ~(USART_CR1_TXEIE);
      return;
    }

    COM_OUTREG = c;
  }
}
#endif

#ifdef MCU_HAS_UART2
#ifndef UART2_TX_BUFFER_SIZE
#define UART2_TX_BUFFER_SIZE 64
#endif
DECL_BUFFER(uint8_t, uart2_tx, UART2_TX_BUFFER_SIZE);
DECL_BUFFER(uint8_t, uart2_rx, RX_BUFFER_SIZE);

void MCU_SERIAL2_ISR(void) {
  if (COM2_UART->ISR & USART_ISR_RXNE) {
    uint8_t c = COM2_INREG;
#if !defined(DETACH_UART2_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(uart2_rx, &c)) {
        STREAM_OVF(c);
      }
    }
#else
    mcu_uart2_rx_cb(c);
#endif
  }

  if ((COM2_UART->ISR & USART_ISR_TXE) && (COM2_UART->CR1 & USART_CR1_TXEIE)) {
    uint8_t c;

    if (!BUFFER_TRY_DEQUEUE(uart2_tx, &c)) {
      COM2_UART->CR1 &= ~(USART_CR1_TXEIE);
      return;
    }

    COM2_OUTREG = c;
  }
}
#endif

#ifdef MCU_HAS_USB
void USB_IRQHandler(void) { tusb_cdc_isr_handler(); }
#endif

// define the mcu internal servo variables
#if SERVOS_MASK > 0

static uint8_t mcu_servos[6];

static FORCEINLINE void mcu_clear_servos() {
#if ASSERT_PIN(SERVO0)
  io_clear_output(SERVO0);
#endif
#if ASSERT_PIN(SERVO1)
  io_clear_output(SERVO1);
#endif
#if ASSERT_PIN(SERVO2)
  io_clear_output(SERVO2);
#endif
#if ASSERT_PIN(SERVO3)
  io_clear_output(SERVO3);
#endif
#if ASSERT_PIN(SERVO4)
  io_clear_output(SERVO4);
#endif
#if ASSERT_PIN(SERVO5)
  io_clear_output(SERVO5);
#endif
}

// starts a constant rate pulse at a given frequency.
void servo_timer_init(void) {
  RCC->SERVO_TIMER_ENREG |= SERVO_TIMER_APB;
  SERVO_TIMER_REG->CR1 = 0;
  SERVO_TIMER_REG->DIER = 0;
  SERVO_TIMER_REG->PSC = (SERVO_CLOCK / 255000) - 1;
  SERVO_TIMER_REG->ARR = 255;
  SERVO_TIMER_REG->EGR |= 0x01;
  SERVO_TIMER_REG->SR &= ~0x01;
}

void servo_start_timeout(uint8_t val) {
  SERVO_TIMER_REG->ARR = (val << 1) + 125;
  NVIC_SetPriority(MCU_SERVO_IRQ, NVIC_SERVO_IRQ_Pri);
  NVIC_ClearPendingIRQ(MCU_SERVO_IRQ);
  NVIC_EnableIRQ(MCU_SERVO_IRQ);
  SERVO_TIMER_REG->DIER |= 1;
  SERVO_TIMER_REG->CR1 |= 1; // enable timer upcounter no preload
}

void MCU_SERVO_ISR(void) {
  if ((SERVO_TIMER_REG->SR & 1)) {
    mcu_clear_servos();
    SERVO_TIMER_REG->DIER = 0;
    SERVO_TIMER_REG->SR = 0;
    SERVO_TIMER_REG->CR1 = 0;
  }
}

#endif

void MCU_ITP_ISR(void) {
  static bool resetstep = false;
  if ((TIMER_REG->SR & 1)) {
    if (!resetstep) {
      mcu_step_cb();
    } else
      mcu_step_reset_cb();
    resetstep = !resetstep;
  }
  TIMER_REG->SR = 0;
}

#define LIMITS_EXTIBITMASK                                                     \
  (LIMIT_X_EXTIBITMASK | LIMIT_Y_EXTIBITMASK | LIMIT_Z_EXTIBITMASK |           \
   LIMIT_X2_EXTIBITMASK | LIMIT_Y2_EXTIBITMASK | LIMIT_Z2_EXTIBITMASK |        \
   LIMIT_A_EXTIBITMASK | LIMIT_B_EXTIBITMASK | LIMIT_C_EXTIBITMASK)
#define CONTROLS_EXTIBITMASK                                                   \
  (ESTOP_EXTIBITMASK | SAFETY_DOOR_EXTIBITMASK | FHOLD_EXTIBITMASK |           \
   CS_RES_EXTIBITMASK)
#define DIN_IO_EXTIBITMASK                                                     \
  (DIN0_EXTIBITMASK | DIN1_EXTIBITMASK | DIN2_EXTIBITMASK | DIN3_EXTIBITMASK | \
   DIN4_EXTIBITMASK | DIN5_EXTIBITMASK | DIN6_EXTIBITMASK | DIN7_EXTIBITMASK)
#define ALL_EXTIBITMASK                                                        \
  (LIMITS_EXTIBITMASK | CONTROLS_EXTIBITMASK | PROBE_EXTIBITMASK |             \
   DIN_IO_EXTIBITMASK)

#if (ALL_EXTIBITMASK != 0)
static void mcu_input_isr(void) {
#if (LIMITS_EXTIBITMASK != 0)
  if (EXTI->PR & LIMITS_EXTIBITMASK) {
    mcu_limits_changed_cb();
  }
#endif
#if (CONTROLS_EXTIBITMASK != 0)
  if (EXTI->PR & CONTROLS_EXTIBITMASK) {
    mcu_controls_changed_cb();
  }
#endif
#if (PROBE_EXTIBITMASK != 0)
  if (EXTI->PR & PROBE_EXTIBITMASK) {
    mcu_probe_changed_cb();
  }
#endif
#if (DIN_IO_EXTIBITMASK != 0)
  if (EXTI->PR & DIN_IO_EXTIBITMASK) {
    mcu_inputs_changed_cb();
  }
#endif

