Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcu_stm32f0x.c
  EXTI->PR = ALL_EXTIBITMASK;
}

#if (ALL_EXTIBITMASK & 0x0001)
void EXTI0_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0002)
void EXTI1_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0004)
void EXTI2_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0008)
void EXTI3_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x0010)
void EXTI4_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0x03E0)
void EXTI9_5_IRQHandler(void) { mcu_input_isr(); }
#endif
#if (ALL_EXTIBITMASK & 0xFC00)
void EXTI15_10_IRQHandler(void) { mcu_input_isr(); }
#endif
#endif

void PendSV_Handler(void) {
  uint32_t millis = mcu_runtime_ms;
  mcu_rtc_cb(millis);
  NVIC_ClearPendingIRQ(PendSV_IRQn);
}

#ifndef ARDUINO_ARCH_STM32
void SysTick_IRQHandler(void)
#else
void osSystickHandler(void)
#endif
{
#if SERVOS_MASK > 0
  static uint8_t ms_servo_counter = 0;
  uint8_t servo_counter = ms_servo_counter;

  switch (servo_counter) {
#if ASSERT_PIN(SERVO0)
  case SERVO0_FRAME:
    servo_start_timeout(mcu_servos[0]);
    io_set_output(SERVO0);
    break;
#endif
#if ASSERT_PIN(SERVO1)
  case SERVO1_FRAME:
    io_set_output(SERVO1);
    servo_start_timeout(mcu_servos[1]);
    break;
#endif
#if ASSERT_PIN(SERVO2)
  case SERVO2_FRAME:
    io_set_output(SERVO2);
    servo_start_timeout(mcu_servos[2]);
    break;
#endif
#if ASSERT_PIN(SERVO3)
  case SERVO3_FRAME:
    io_set_output(SERVO3);
    servo_start_timeout(mcu_servos[3]);
    break;
#endif
#if ASSERT_PIN(SERVO4)
  case SERVO4_FRAME:
    io_set_output(SERVO4);
    servo_start_timeout(mcu_servos[4]);
    break;
#endif
#if ASSERT_PIN(SERVO5)
  case SERVO5_FRAME:
    io_set_output(SERVO5);
    servo_start_timeout(mcu_servos[5]);
    break;
#endif
  }

  servo_counter++;
  ms_servo_counter = (servo_counter != 20) ? servo_counter : 0;

#endif
  mcu_runtime_ms++;
  SCB->ICSR = SCB_ICSR_PENDSVSET_Msk; // signal low priority task
}

/**
 *
 * Initializes the mcu:
 *   1. Configures all IO
 *   2. Configures UART/USB
 *   3. Starts internal clock (RTC)
 **/
static void mcu_rtc_init(void);
static void mcu_usart_init(void);

void mcu_clocks_init() {
  SystemCoreClockUpdate();

  // initialize debugger clock (used by us delay)
  // if (!(CoreDebug->DEMCR & CoreDebug_DEMCR_TRCENA_Msk))
  // {
  // 	CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
  // 	DWT->CYCCNT = 0;
  // 	DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;
  // }
}

void mcu_usb_init(void) {
#ifdef MCU_HAS_USB
  // configure USB as Virtual COM port
  mcu_config_input(USB_DM);
  mcu_config_input(USB_DP);
  // mcu_config_af(USB_DP, GPIO_OTG_FS);
  // mcu_config_af(USB_DM, GPIO_OTG_FS);
  RCC->APB1ENR |= (RCC_APB1ENR_USBEN);
  /* Disable all interrupts. */

  NVIC_SetPriority(USB_IRQn, NVIC_USB_IRQ_Pri);
  NVIC_ClearPendingIRQ(USB_IRQn);
  NVIC_EnableIRQ(USB_IRQn);

  tusb_cdc_init();
#endif
}

void mcu_uart_init(void) {
#ifdef MCU_HAS_UART
  /*enables RCC clocks and GPIO*/
  RCC->COM_APB |= (COM_APBEN);
  mcu_config_af(TX, UART_TX_AFIO);
  mcu_config_af(RX, UART_RX_AFIO);
  /*setup UART*/
  COM_UART->CR1 = 0; // 8 bits No parity M=0 PCE=0
  COM_UART->CR2 = 0; // 1 stop bit STOP=00
  COM_UART->CR3 = 0;
  COM_UART->ISR = 0;
  // //115200 baudrate
  float baudrate = ((float)(UART_CLOCK >> 4) / ((float)(BAUDRATE)));
  uint16_t brr = (uint16_t)baudrate;
  baudrate -= brr;
  brr <<= 4;
  brr += (uint16_t)roundf(16.0f * baudrate);
  COM_UART->BRR = brr;
  COM_UART->CR1 |= USART_CR1_RXNEIE; // enable RXNEIE
  NVIC_SetPriority(COM_IRQ, NVIC_UART_IRQ_Pri);
  NVIC_ClearPendingIRQ(COM_IRQ);
  NVIC_EnableIRQ(COM_IRQ);
  COM_UART->CR1 |=
      (USART_CR1_RE | USART_CR1_TE | USART_CR1_UE); // enable TE, RE and UART
#endif
}

void mcu_uart2_init(void) {
#ifdef MCU_HAS_UART2
  /*enables RCC clocks and GPIO*/
  RCC->COM2_APB |= (COM2_APBEN);
  mcu_config_af(TX2, UART2_TX_AFIO);
  mcu_config_af(RX2, UART2_RX_AFIO);
  /*setup UART*/
  COM2_UART->CR1 = 0; // 8 bits No parity M=0 PCE=0
  COM2_UART->CR2 = 0; // 1 stop bit STOP=00
  COM2_UART->CR3 = 0;
  COM2_UART->ISR = 0;
  // //115200 baudrate
  float baudrate2 = ((float)(UART2_CLOCK >> 4) / ((float)(BAUDRATE2)));
  uint16_t brr2 = (uint16_t)baudrate2;
  baudrate2 -= brr2;
  brr2 <<= 4;
  brr2 += (uint16_t)roundf(16.0f * baudrate2);
  COM2_UART->BRR = brr2;
  COM2_UART->CR1 |= USART_CR1_RXNEIE; // enable RXNEIE
  NVIC_SetPriority(COM2_IRQ, NVIC_UART_IRQ_Pri);
  NVIC_ClearPendingIRQ(COM2_IRQ);
  NVIC_EnableIRQ(COM2_IRQ);
  COM2_UART->CR1 |=
      (USART_CR1_RE | USART_CR1_TE | USART_CR1_UE); // enable TE, RE and UART
#endif
}

#ifdef MCU_HAS_USB
DECL_BUFFER(uint8_t, usb_rx, RX_BUFFER_SIZE);

uint8_t mcu_usb_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(usb_rx, &c);
  return c;
}

uint8_t mcu_usb_available(void) { return BUFFER_READ_AVAILABLE(usb_rx); }

void mcu_usb_clear(void) { BUFFER_CLEAR(usb_rx); }

void mcu_usb_putc(uint8_t c) {
  if (!tusb_cdc_write_available()) {
    mcu_usb_flush();
  }
  tusb_cdc_write(c);
}

void mcu_usb_flush(void) {
  tusb_cdc_flush();
  while (!tusb_cdc_write_available()) {
    mcu_dotasks(); // tinyusb device task
    if (!tusb_cdc_connected) {
      return;
    }
  }
}
#endif

#ifdef MCU_HAS_UART
uint8_t mcu_uart_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(uart_rx, &c);
  return c;
}

uint8_t mcu_uart_available(void) { return BUFFER_READ_AVAILABLE(uart_rx); }

void mcu_uart_clear(void) { BUFFER_CLEAR(uart_rx); }

void mcu_uart_putc(uint8_t c) {
  while (!BUFFER_TRY_ENQUEUE(uart_tx, &c)) {
    mcu_uart_flush();
  }
}

void mcu_uart_flush(void) {

  if (!(COM_UART->CR1 & USART_CR1_TXEIE)) // not ready start flushing
  {
    COM_UART->CR1 |= (USART_CR1_TXEIE);
#if ASSERT_PIN(ACTIVITY_LED)
    io_toggle_output(ACTIVITY_LED);
#endif
  }
}

#endif

#ifdef MCU_HAS_UART2
uint8_t mcu_uart2_getc(void) {
  uint8_t c = 0;
  BUFFER_TRY_DEQUEUE(uart2_rx, &c);
  return c;
}

uint8_t mcu_uart2_available(void) { return BUFFER_READ_AVAILABLE(uart2_rx); }

void mcu_uart2_clear(void) { BUFFER_CLEAR(uart2_rx); }

void mcu_uart2_putc(uint8_t c) {
  while (!BUFFER_TRY_ENQUEUE(uart2_tx, &c)) {
    mcu_uart2_flush();
  }
}

void mcu_uart2_flush(void) {
  if (!(COM2_UART->CR1 & USART_CR1_TXEIE)) // not ready start flushing
  {
    COM2_UART->CR1 |= (USART_CR1_TXEIE);
#if ASSERT_PIN(ACTIVITY_LED)
    io_toggle_output(ACTIVITY_LED);
#endif
  }
}

#endif

void mcu_spi_init() {
#ifdef MCU_HAS_SPI
  SPI_ENREG |= SPI_ENVAL;
  mcu_config_af(SPI_SDI, SPI_SDI_AFIO);
  mcu_config_af(SPI_CLK, SPI_CLK_AFIO);
  mcu_config_af(SPI_SDO, SPI_SDO_AFIO);

