Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcu_stm32f0x.c
  RCC->AHBENR |= RCC_AHBENR_DMAEN;
#if ASSERT_PIN_IO(SPI_CS)
  mcu_config_af(SPI_CS, SPI_CS_AFIO);
#endif
  // initialize the SPI configuration register
  SPI_REG->CR1 = SPI_CR1_SSM     // software slave management enabled
                 | SPI_CR1_SSI   // internal slave select
                 | SPI_CR1_MSTR; // SPI master mode
                                 //    | (SPI_SPEED << 3) | SPI_MODE;
  spi_config_t spi_conf = {0};
  spi_conf.mode = SPI_MODE;
  mcu_spi_config(spi_conf, SPI_FREQ);

  NVIC_SetPriority(SPI_IRQ, NVIC_SPI_IRQ_Pri);
  NVIC_ClearPendingIRQ(SPI_IRQ);
  NVIC_EnableIRQ(SPI_IRQ);

  SPI_REG->CR1 |= SPI_CR1_SPE;
#endif
}

void mcu_spi2_init() {
#ifdef MCU_HAS_SPI2
  SPI2_ENREG |= SPI2_ENVAL;
  mcu_config_af(SPI2_SDI, SPI2_SDI_AFIO);
  mcu_config_af(SPI2_CLK, SPI2_CLK_AFIO);
  mcu_config_af(SPI2_SDO, SPI2_SDO_AFIO);

  RCC->AHBENR |= RCC_AHBENR_DMAEN;
  // #if ASSERT_PIN_IO(SPI2_CS)
  // 	mcu_config_af(SPI2_CS, SPI2_CS_AFIO);
  // #endif
  // initialize the SPI2 configuration register
  SPI2_REG->CR1 = SPI_CR1_SSM     // software slave management enabled
                  | SPI_CR1_SSI   // internal slave select
                  | SPI_CR1_MSTR; // SPI2 master mode
                                  //    | (SPI2_SPEED << 3) | SPI2_MODE;
  spi_config_t spi2_conf = {0};
  spi2_conf.mode = SPI2_MODE;
  mcu_spi2_config(spi2_conf, SPI2_FREQ);

  NVIC_SetPriority(SPI2_IRQ, NVIC_SPI_IRQ_Pri);
  NVIC_ClearPendingIRQ(SPI2_IRQ);
  NVIC_EnableIRQ(SPI2_IRQ);

  SPI2_REG->CR1 |= SPI_CR1_SPE;
#endif
}

void mcu_i2c_init() {
#ifdef MCU_HAS_I2C
  // set max freq
  mcu_i2c_config(I2C_FREQ);
#endif
}

void mcu_init(void) {
  // make sure both APB1 and APB2 are running at the same clock (48MHz)
  mcu_clocks_init();
  mcu_io_init();
  mcu_rtc_init();
#if SERVOS_MASK > 0
  servo_timer_init();
#endif

  stm32_flash_current_page = -1;
  mcu_enable_global_isr();
}

/*IO functions*/
// IO functions
void mcu_set_servo(uint8_t servo, uint8_t value) {
#if SERVOS_MASK > 0
  mcu_servos[servo - SERVO_PINS_OFFSET] = value;
#endif
}

/**
 * gets the pwm for a servo (50Hz with tON between 1~2ms)
 * can be defined either as a function or a macro call
 * */
uint8_t mcu_get_servo(uint8_t servo) {
#if SERVOS_MASK > 0
  uint8_t offset = servo - SERVO_PINS_OFFSET;

  if ((1U << offset) & SERVOS_MASK) {
    return mcu_servos[offset];
  }
#endif
  return 0;
}

// ISR
// enables all interrupts on the mcu. Must be called to enable all IRS functions
#ifndef mcu_enable_global_isr
#error "mcu_enable_global_isr undefined"
#endif
// disables all ISR functions
#ifndef mcu_disable_global_isr
#error "mcu_disable_global_isr undefined"
#endif

// Timers
// convert step rate to clock cycles
void mcu_freq_to_clocks(float frequency, uint16_t *ticks,
                        uint16_t *prescaller) {
  frequency = CLAMP((float)F_STEP_MIN, frequency, (float)F_STEP_MAX);

  // up and down counter (generates half the step rate at each event)
  uint32_t totalticks = (uint32_t)((float)(TIMER_CLOCK) / frequency);
  *prescaller = 1;
  while (totalticks > 0xFFFF) {
    *prescaller <<= 1;
    totalticks >>= 1;
  }

  (*prescaller) -= 1;
  *ticks = (uint16_t)totalticks;
}

float mcu_clocks_to_freq(uint16_t ticks, uint16_t prescaller) {
  return ((float)TIMER_CLOCK / (float)(((uint32_t)ticks) << (prescaller)));
}

// starts a constant rate pulse at a given frequency.
void mcu_start_itp_isr(uint16_t ticks, uint16_t prescaller) {
  RCC->TIMER_ENREG |= TIMER_APB;
  TIMER_REG->CR1 = 0;
  TIMER_REG->DIER = 0;
  TIMER_REG->PSC = prescaller;
  TIMER_REG->ARR = ticks;
  TIMER_REG->EGR |= 0x01;
  TIMER_REG->SR &= ~0x01;

  NVIC_SetPriority(MCU_ITP_IRQ, NVIC_ITP_IRQ_Pri);
  NVIC_ClearPendingIRQ(MCU_ITP_IRQ);
  NVIC_EnableIRQ(MCU_ITP_IRQ);

  TIMER_REG->DIER |= 1;
  TIMER_REG->CR1 |= 1; // enable timer upcounter no preload
}

// modifies the pulse frequency
void mcu_change_itp_isr(uint16_t ticks, uint16_t prescaller) {
  TIMER_REG->ARR = ticks;
  TIMER_REG->PSC = prescaller;
  TIMER_REG->EGR |= 0x01;
}

// stops the pulse
void mcu_stop_itp_isr(void) {
  TIMER_REG->CR1 &= ~0x1;
  TIMER_REG->DIER &= ~0x1;
  TIMER_REG->SR &= ~0x01;
  NVIC_DisableIRQ(MCU_ITP_IRQ);
}

// Custom delay function
// gets the mcu running time in ms
uint32_t mcu_millis() { return mcu_runtime_ms; }

uint32_t mcu_micros() { return ((mcu_runtime_ms * 1000) + mcu_free_micros()); }

void mcu_rtc_init() {
  SysTick->CTRL = 0;
  SysTick->LOAD = ((SystemCoreClock / 1000) - 1);
  SysTick->VAL = 0;
  NVIC_SetPriority(SysTick_IRQn, NVIC_RTC_IRQ_Pri);
  SysTick->CTRL = 7;                   // Start SysTick (ABH clock)
  NVIC_SetPriority(PendSV_IRQn, 0xFF); // background task
}

void mcu_dotasks() {
#ifdef MCU_HAS_USB
  tusb_cdc_task(); // tinyusb device task

  while (tusb_cdc_available()) {
    uint8_t c = (uint8_t)tusb_cdc_read();
#if !defined(DETACH_USB_FROM_MAIN_PROTOCOL)
    if (mcu_com_rx_cb(c)) {
      if (!BUFFER_TRY_ENQUEUE(usb_rx, &c)) {
        BUFFER_CLEAR(usb_rx);
        STREAM_OVF(c);
      }
    }
#else
    mcu_usb_rx_cb(c);
#endif
  }
#endif
}

// checks if the current page is loaded to ram
// if not loads it
static uint16_t mcu_access_flash_page(uint16_t address) {
  uint16_t address_page = address & FLASH_PAGE_MASK;
  uint16_t address_offset = address & FLASH_PAGE_OFFSET_MASK;
  if (stm32_flash_current_page != address_page) {
    mcu_eeprom_flush();
    stm32_flash_modified = false;
    stm32_flash_current_page = address_page;
    uint16_t counter = (uint16_t)(FLASH_PAGE_SIZE >> 2);
    uint32_t *ptr = ((uint32_t *)&stm32_flash_page[0]);
    volatile uint32_t *eeprom =
        ((volatile uint32_t *)(FLASH_EEPROM + address_page));
    while (counter--) {
      READ_FLASH(ptr, eeprom);
      eeprom++;
      ptr++;
    }
  }

  return address_offset;
}

// Non volatile memory
uint8_t mcu_eeprom_getc(uint16_t address) {
  if (NVM_STORAGE_SIZE <= address) {
    DBGMSG("EEPROM invalid address @ %u", address);
    return 0;
  }
  uint16_t offset = mcu_access_flash_page(address);
  return stm32_flash_page[offset];
}

static void mcu_eeprom_erase(uint16_t address) {
#ifndef DISABLE_EEPROM_EMULATION
  while (FLASH->SR & FLASH_SR_BSY)
    ; // wait while busy
  // unlock flash if locked
  if (FLASH->CR & FLASH_CR_LOCK) {
    FLASH->KEYR = 0x45670123;
    FLASH->KEYR = 0xCDEF89AB;
  }
  FLASH->CR = 0;             // Ensure PG bit is low
  FLASH->CR |= FLASH_CR_PER; // set the PER bit
  FLASH->AR = (FLASH_EEPROM + address);
  FLASH->CR |= FLASH_CR_STRT; // set the start bit
  while (FLASH->SR & FLASH_SR_BSY)
    ; // wait while busy
  FLASH->CR = 0;
#endif
}

void mcu_eeprom_putc(uint16_t address, uint8_t value) {
  if (NVM_STORAGE_SIZE <= address) {
    DBGMSG("EEPROM invalid address @ %u", address);
  }

  uint16_t offset = mcu_access_flash_page(address);

  if (stm32_flash_page[offset] != value) {
    stm32_flash_modified = true;
  }

  stm32_flash_page[offset] = value;
}

void mcu_eeprom_flush() {
#ifndef DISABLE_EEPROM_EMULATION
  if (stm32_flash_modified) {
    mcu_eeprom_erase(stm32_flash_current_page);
    volatile uint16_t *eeprom =
        ((volatile uint16_t *)(FLASH_EEPROM + stm32_flash_current_page));
    uint16_t *ptr = ((uint16_t *)&stm32_flash_page[0]);
    uint16_t counter = (uint16_t)(FLASH_PAGE_SIZE >> 1);
    while (counter--) {
      while (FLASH->SR & FLASH_SR_BSY)
        ; // wait while busy
      mcu_disable_global_isr();
      // unlock flash if locked
      if (FLASH->CR & FLASH_CR_LOCK) {
        FLASH->KEYR = 0x45670123;
        FLASH->KEYR = 0xCDEF89AB;
      }
      FLASH->CR = 0;
      FLASH->CR |= FLASH_CR_PG; // Ensure PG bit is high
      WRITE_FLASH(eeprom, ptr);
      while (FLASH->SR & FLASH_SR_BSY)
        ; // wait while busy
      mcu_enable_global_isr();
      if (FLASH->SR & FLASH_SR_PGERR)
        proto_error(42); // STATUS_SETTING_WRITE_FAIL
      if (FLASH->SR & FLASH_SR_WRPRTERR)
        proto_error(43); // STATUS_SETTING_PROTECTED_FAIL
      FLASH->CR = 0;     // Ensure PG bit is low
      FLASH->SR = 0;
      eeprom++;
      ptr++;
    }
    stm32_flash_modified = false;
    // Restore interrupt flag state.*/
  }
#endif
}

typedef enum spi_port_state_enum {
  SPI_UNKNOWN = 0,
  SPI_IDLE = 1,
  SPI_TRANSMITTING = 2,
  SPI_TRANSMIT_COMPLETE = 3,
} spi_port_state_t;

#ifdef MCU_HAS_SPI
static volatile spi_port_state_t spi_port_state = SPI_UNKNOWN;
static bool spi_enable_dma = false;

void mcu_spi_config(spi_config_t config, uint32_t frequency) {
  uint8_t div = (uint8_t)(SPI_CLOCK / frequency);

  uint8_t speed;
  if (div < 2) {
    speed = 0;
  } else if (div < 4) {
    speed = 1;
  } else if (div < 8) {
    speed = 2;
  } else if (div < 16) {
    speed = 3;
  } else if (div < 32) {
    speed = 4;
  } else if (div < 64) {
    speed = 5;
  } else if (div < 128) {
    speed = 6;
  } else {
    speed = 7;
  }

  // disable SPI
  SPI_REG->CR1 &= ~SPI_CR1_SPE;
  // clear speed and mode
  SPI_REG->CR1 &= ~0x3B;
  SPI_REG->CR1 |= (speed << 3) | config.mode;
  // enable SPI
  SPI_REG->CR1 |= SPI_CR1_SPE;

  spi_port_state = SPI_IDLE;
  spi_enable_dma = config.enable_dma;
}

uint8_t mcu_spi_xmit(uint8_t c) {
  SPI_REG->DR = c;
  while (!(SPI_REG->SR & SPI_SR_TXE) || (SPI_REG->SR & SPI_SR_BSY))
    ;
  uint8_t data = SPI_REG->DR;
  spi_port_state = SPI_IDLE;
  return data;
}

static const uint8_t *spi_transfer_tx_ptr = 0;
static uint8_t *spi_transfer_rx_ptr = 0;
static uint16_t spi_transfer_tx_len = 0;
static uint16_t spi_transfer_rx_len = 0;

