Paciente8159/uCNC/uCNC/src/hal/mcus/stm32f0x/mcu_stm32f0x.c
    // Transfer finished
    spi2_port_state = SPI_IDLE;
    return false;
  }

  if (spi2_port_state != SPI_IDLE) {
    // Wait for idle
    if (SPI2_REG->SR & SPI_SR_BSY)
      return true;
    spi2_port_state = SPI_IDLE;
  }

  // Wait until streams are available
  if ((SPI2_DMA_TX_CHANNEL->CCR & DMA_CCR_EN) ||
      ((SPI2_DMA_RX_CHANNEL->CCR & DMA_CCR_EN) && rx_data))
    return true;

  /***     Setup Transmit DMA     ***/

  // Clear flags
  DMA1->IFCR |= SPI2_DMA_TX_IFCR_MASK;

  SPI2_DMA_TX_CHANNEL->CCR = (0b01 << DMA_CCR_PL_Pos) | // Priority medium
                             DMA_CCR_MINC |             // Increment memory
                             DMA_CCR_DIR;               // Memory to peripheral

  SPI2_DMA_TX_CHANNEL->CPAR = (uint32_t)&SPI2_REG->DR;
  SPI2_DMA_TX_CHANNEL->CMAR = (uint32_t)tx_data;

  SPI2_DMA_TX_CHANNEL->CNDTR = datalen;

  // Enable DMA use for transmission
  SPI2_REG->CR2 |= SPI_CR2_TXDMAEN;

  if (rx_data) {
    /***     Setup Receive DMA     ***/

    // Clear flags
    DMA1->IFCR |= SPI2_DMA_RX_IFCR_MASK;

    SPI2_DMA_RX_CHANNEL->CCR = (0b01 << DMA_CCR_PL_Pos) | // Priority medium
                               DMA_CCR_MINC;              // Increment memory

    SPI2_DMA_RX_CHANNEL->CPAR = (uint32_t)&SPI2_REG->DR;
    SPI2_DMA_RX_CHANNEL->CMAR = (uint32_t)rx_data;

    SPI2_DMA_RX_CHANNEL->CNDTR = datalen;

    // Enable DMA use for reception
    SPI2_REG->CR2 |= SPI_CR2_RXDMAEN;
  }

  /***     DMA Setup Complete     ***/

  // Start streams
  SPI2_DMA_TX_CHANNEL->CCR |= DMA_CCR_EN;
  if (rx_data)
    SPI2_DMA_RX_CHANNEL->CCR |= DMA_CCR_EN;

  // Transmission started
  spi2_port_state = SPI_TRANSMITTING;
  return true;
}
#endif

#ifdef MCU_HAS_I2C

#if I2C_ADDRESS == 0
#define STM_VAL2REG(val, X) (uint32_t)(((((uint32_t)val) << X##_Pos) & X##_Msk))

void mcu_i2c_stop(bool *stop) {
  // not working (using autostop)
  while (!(I2C_REG->ISR & I2C_ISR_TC))
    ;
  I2C_REG->CR2 |= I2C_CR2_STOP;
  while (!(I2C_REG->ISR & I2C_ISR_STOPF))
    ;
  I2C_REG->ICR |= I2C_ICR_STOPCF;
  I2C_REG->CR2 = 0x0;
  I2C_REG->CR1 &= ~I2C_CR1_PE;
}

#ifndef mcu_i2c_send
// master sends command to slave
uint8_t mcu_i2c_send(uint8_t address, uint8_t *data, uint8_t datalen,
                     bool release, uint32_t ms_timeout) {
  // bool stop __attribute__((__cleanup__(mcu_i2c_stop))) = release;

  if (!data || !datalen) {
    return I2C_NOTOK;
  }

  /*Enable I2C*/
  I2C_REG->CR1 |= I2C_CR1_PE;
  /*Set slave address*/
  I2C_REG->CR2 = (address << 1);
  /*7-bit addressing*/
  I2C_REG->CR2 &= ~I2C_CR2_ADD10;
  /*Set number to transfer to length for write operation*/
  I2C_REG->CR2 |= (datalen << I2C_CR2_NBYTES_Pos);
  if (release) {
    I2C_REG->CR2 |= I2C_CR2_AUTOEND;
  }
  /*Set the mode to write mode*/
  I2C_REG->CR2 &= ~I2C_CR2_RD_WRN;
  /*Generate start*/
  I2C_REG->CR2 |= I2C_CR2_START;
  for (uint8_t i = 0; i < datalen; i++) {
    /*Check if TX buffer is empty*/
    uint32_t t = ms_timeout;
    __TIMEOUT_MS__(t) {
      if ((I2C_REG->ISR & I2C_ISR_NACKF)) {
        // stop = true;
        I2C_REG->CR2 |= I2C_CR2_STOP;
        return I2C_NOTOK;
      }

      if ((I2C_REG->ISR & (I2C_ISR_TXE))) {
        break;
      }
    }

    __TIMEOUT_ASSERT__(t) {
      I2C_REG->CR2 |= I2C_CR2_STOP;
      return I2C_NOTOK;
    }

    /*send memory address*/
    I2C_REG->TXDR = data[i];
  }

  if (release) {
    uint32_t t = ms_timeout;
    __TIMEOUT_MS__(t) {
      if ((I2C_REG->ISR & I2C_ISR_TC)) {
        break;
      }
    }

    __TIMEOUT_ASSERT__(t) { return I2C_NOTOK; }
  }

  return I2C_OK;
}
#endif

#ifndef mcu_i2c_receive
// master receive response from slave
uint8_t mcu_i2c_receive(uint8_t address, uint8_t *data, uint8_t datalen,
                        uint32_t ms_timeout) {
  // bool stop __attribute__((__cleanup__(mcu_i2c_stop))) = true;

  if (!data || !datalen) {
    return I2C_NOTOK;
  }

  uint32_t t = ms_timeout;
  __TIMEOUT_MS__(t) {
    if (!(I2C_REG->ISR & I2C_ISR_BUSY)) {
      break;
    }
  }

  __TIMEOUT_ASSERT__(t) { return I2C_NOTOK; }

  /*Enable I2C*/
  I2C_REG->CR1 |= I2C_CR1_PE;
  I2C_REG->CR2 = I2C_CR2_HEAD10R | I2C_CR2_RD_WRN |
                 STM_VAL2REG(datalen, I2C_CR2_NBYTES) | (address << 1) |
                 I2C_CR2_AUTOEND;
  I2C_REG->CR2 |= I2C_CR2_START;
  while ((I2C_REG->CR2 & I2C_CR2_START))
    ;
  for (uint8_t i = 0; i < datalen; i++) {
    t = ms_timeout;
    __TIMEOUT_MS__(t) {
      if (((I2C_REG->ISR & I2C_ISR_BERR)) || ((I2C_REG->ISR & I2C_ISR_ARLO))) {
        return I2C_NOTOK;
      }
      if ((I2C_REG->ISR & I2C_ISR_RXNE)) {
        break;
      }
    }

    __TIMEOUT_ASSERT__(t) { return I2C_NOTOK; }

    data[i] = (uint8_t)I2C_REG->RXDR;
  }

  return I2C_OK;
}
#endif
#endif

#ifndef mcu_i2c_config
void mcu_i2c_config(uint32_t frequency) {
  RCC->APB1ENR &= ~I2C_APBEN;
  I2C_REG->CR1 &= ~I2C_CR1_PE;
  RCC->APB1RSTR |= __helper__(RCC_APB1RSTR_I2C, I2C_PORT, RST);
  RCC->APB1RSTR &= ~(__helper__(RCC_APB1RSTR_I2C, I2C_PORT, RST));
  RCC->APB1ENR |= I2C_APBEN;
  mcu_config_af(I2C_CLK, I2C_CLK_AFIO);
  mcu_config_af(I2C_DATA, I2C_DATA_AFIO);
  mcu_config_pullup(I2C_CLK);
  mcu_config_pullup(I2C_DATA);
  // set opendrain
  // mcu_config_opendrain(I2C_CLK);
  // mcu_config_opendrain(I2C_DATA);
#ifdef I2C_REMAP
  AFIO->MAPR |= I2C_REMAP;
#endif
  I2C_REG->CR1 &= ~(I2C_CR1_ANFOFF | I2C_CR1_DNF);
#if I2C_ADDRESS == 0

  float risetime = 8333333.3f, falltime = 8333333.3f;
  if (frequency <= 100000UL) // standart mode (max fall time 1000ns(1Mhz) and
                             // max rise time 300ns(3,3MHZ))
  {
    risetime = 1000000.0f;
    falltime = 3333333.3f;
  } else if (frequency <= 400000UL) // fast mode
  {
    risetime = 3333333.3f;
    falltime = 3333333.3f;
  }

  // set max freq
  uint8_t presc = 0;
  while ((HAL_RCC_GetPCLK1Freq() / (presc + 1)) > (frequency * 0xff) ||
         (HAL_RCC_GetPCLK1Freq() / (presc + 1)) >
             (((uint32_t)falltime) * 0xf)) {
    presc++;
  }

  float i2c_osc = ((float)HAL_RCC_GetPCLK1Freq() / (presc + 1));
  uint8_t scll = 0,
          sclh = scll =
              (uint8_t)CLAMP(0, (i2c_osc / (frequency * 2) - 1),
                             0xFFFF); // half time clock up and clock down

  uint8_t scldel =
      (uint8_t)CLAMP(0, (ceilf((float)i2c_osc / risetime) - 1), 0x0F);
  uint8_t sdadel =
      (uint8_t)CLAMP(0, (ceilf((float)i2c_osc / falltime) - 1), 0x0F);

  sclh -= (sclh >= sdadel) ? sdadel : 0;
  // presc = 0; scll = 0x9; sclh=0x3; sdadel = 0x1; scldel = 0x3;
  uint32_t tmr = (STM_VAL2REG(presc, I2C_TIMINGR_PRESC) |
                  STM_VAL2REG(scll, I2C_TIMINGR_SCLL) |
                  STM_VAL2REG(sclh, I2C_TIMINGR_SCLH) |
                  STM_VAL2REG(scldel, I2C_TIMINGR_SCLDEL) |
                  STM_VAL2REG(sdadel, I2C_TIMINGR_SDADEL));
  I2C_REG->CR1 &= ~(I2C_CR1_ANFOFF | I2C_CR1_DNF);
  I2C_REG->TIMINGR = tmr; // 0xB0420F13;
  I2C_REG->CR1 &= ~(I2C_CR1_NOSTRETCH);
  I2C_REG->CR2 = 0;
#else
  // set address
  I2C_REG->OAR1 &= ~(I2C_OAR1_OA1MODE | 0x0F);
  I2C_REG->OAR1 |= (I2C_ADDRESS << 1);
  I2C_REG->OAR2 = 0;
  I2C_REG->CR1 &= ~I2C_CR1_NOSTRETCH;
  // enable interrupts
  I2C_REG->CR1 |= (I2C_CR1_RXIE | I2C_CR1_TXIE | I2C_CR1_ADDRIE);
  NVIC_SetPriority(I2C_IRQ, NVIC_I2C_IRQ_Pri);
  NVIC_ClearPendingIRQ(I2C_IRQ);
  NVIC_EnableIRQ(I2C_IRQ);
#endif
  // initialize the SPI configuration register
  I2C_REG->CR1 |= I2C_CR1_PE;
#if I2C_ADDRESS != 0
  I2C_REG->CR1 |= I2C_CR1_GCEN;
  // prepare ACK in slave mode
  I2C_REG->CR2 &= ~I2C_CR2_NACK;
#endif
}
#endif

